```terraform
[command]/home/runner/work/_temp/1eb9b86a-0b90-4a30-81b5-a36bf2156037/terraform-bin plan -out=environment.tfplan -no-color
module.s3.aws_s3_bucket_public_access_block.test: Refreshing state... [id=matchya-staging-data-question-response-video]
data.aws_ssm_parameter.route53_zone_id: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.s3.aws_s3_bucket_cors_configuration.test: Refreshing state... [id=matchya-staging-data-question-response-video]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.s3.aws_s3_bucket_policy.test: Refreshing state... [id=matchya-staging-data-question-response-video]
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.s3.aws_s3_bucket.company_assets: Refreshing state... [id=matchya-staging-company-assets]
module.s3.aws_s3_bucket.test: Refreshing state... [id=matchya-staging-data-question-response-video]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]
module.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]
module.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]
module.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=791901361445]
module.route53[0].data.aws_route53_zone.main: Reading...
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]
data.aws_ssm_parameter.route53_hosted_zone: Reading...
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.vpc.data.aws_vpc.default: Reading...
module.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]
data.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 1s [id=lambda_role]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.route53[0].data.aws_route53_zone.main: Read complete after 1s [id=Z0419438LZ88EPNOCFMA]
module.s3.aws_s3_bucket_public_access_block.company_assets: Refreshing state... [id=matchya-staging-company-assets]
aws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]
module.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.s3.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=matchya-staging-company-assets]
module.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]
module.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]
module.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]
module.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]
module.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b17f8e4d9515df62]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]
module.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]
module.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]
module.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0fa7cfaddc1224493]
module.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]
module.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]
module.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]
module.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]
module.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]
module.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]
module.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]
module.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]
module.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]
module.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]
module.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]
module.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]
module.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]
module.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]
module.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]
module.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]
module.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]
module.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]
module.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]
module.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]
module.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]
module.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]
module.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]
module.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]
module.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]
module.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]
module.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.rds.aws_db_instance.secure[0] will be updated in-place
  ~ resource "aws_db_instance" "secure" {
      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-31-06-18-18" -> (known after apply)
        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"
        tags                                  = {}
        # (52 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.data_question_response_video will be created
  + resource "aws_s3_bucket" "data_question_response_video" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "matchya-staging-data-question-response-video"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.test will be destroyed
  # (because aws_s3_bucket.test is not in configuration)
  - resource "aws_s3_bucket" "test" {
      - arn                         = "arn:aws:s3:::matchya-staging-data-question-response-video" -> null
      - bucket                      = "matchya-staging-data-question-response-video" -> null
      - bucket_domain_name          = "matchya-staging-data-question-response-video.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "matchya-staging-data-question-response-video.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "matchya-staging-data-question-response-video" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "GET",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "app.staging.matchya.ai",
            ] -> null
          - expose_headers  = [
              - "ETag",
            ] -> null
          - max_age_seconds = 3000 -> null
        }

      - grant {
          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3.aws_s3_bucket_cors_configuration.data_question_response_video will be created
  + resource "aws_s3_bucket_cors_configuration" "data_question_response_video" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_cors_configuration.test will be destroyed
  # (because aws_s3_bucket_cors_configuration.test is not in configuration)
  - resource "aws_s3_bucket_cors_configuration" "test" {
      - bucket = "matchya-staging-data-question-response-video" -> null
      - id     = "matchya-staging-data-question-response-video" -> null

      - cors_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.s3.aws_s3_bucket_policy.data_question_response_video will be created
  + resource "aws_s3_bucket_policy" "data_question_response_video" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.test will be destroyed
  # (because aws_s3_bucket_policy.test is not in configuration)
  - resource "aws_s3_bucket_policy" "test" {
      - bucket = "matchya-staging-data-question-response-video" -> null
      - id     = "matchya-staging-data-question-response-video" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.s3.aws_s3_bucket_public_access_block.data_question_response_video will be created
  + resource "aws_s3_bucket_public_access_block" "data_question_response_video" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.s3.aws_s3_bucket_public_access_block.test will be destroyed
  # (because aws_s3_bucket_public_access_block.test is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "test" {
      - block_public_acls       = false -> null
      - block_public_policy     = false -> null
      - bucket                  = "matchya-staging-data-question-response-video" -> null
      - id                      = "matchya-staging-data-question-response-video" -> null
      - ignore_public_acls      = false -> null
      - restrict_public_buckets = false -> null
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: environment.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "environment.tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.s3.aws_s3_bucket_public_access_block.test: Refreshing state... [id=matchya-staging-data-question-response-video]%0Adata.aws_ssm_parameter.route53_zone_id: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.s3.aws_s3_bucket_cors_configuration.test: Refreshing state... [id=matchya-staging-data-question-response-video]%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.s3.aws_s3_bucket_policy.test: Refreshing state... [id=matchya-staging-data-question-response-video]%0Amodule.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.s3.aws_s3_bucket.company_assets: Refreshing state... [id=matchya-staging-company-assets]%0Amodule.s3.aws_s3_bucket.test: Refreshing state... [id=matchya-staging-data-question-response-video]%0Adata.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/terraform/shared/route53/zone_id]%0Amodule.app[0].aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1ENRFIZYLVUVH]%0Amodule.dynamodb.aws_dynamodb_table.interview_access_token: Refreshing state... [id=staging-InterviewAccessToken]%0Amodule.ec2.aws_key_pair.bastion[0]: Refreshing state... [id=staging-bastion_key_pair]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_caller_identity.current: Read complete after 0s [id=791901361445]%0Amodule.route53[0].data.aws_route53_zone.main: Reading...%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.aws_vpc.main[0]: Refreshing state... [id=vpc-0a2c6ea576ea1c2a5]%0Adata.aws_ssm_parameter.route53_hosted_zone: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.ec2.aws_eip.nat[0]: Refreshing state... [id=eipalloc-00a8a7c27741f73bd]%0Adata.aws_ssm_parameter.route53_hosted_zone: Read complete after 0s [id=/terraform/shared/route53/hosted_zone]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Adata.aws_region.current: Reading...%0Adata.aws_region.current: Read complete after 0s [id=us-east-1]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 1s [id=lambda_role]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.route53[0].data.aws_route53_zone.main: Read complete after 1s [id=Z0419438LZ88EPNOCFMA]%0Amodule.s3.aws_s3_bucket_public_access_block.company_assets: Refreshing state... [id=matchya-staging-company-assets]%0Aaws_ssm_parameter.domain_name: Refreshing state... [id=/terraform/staging/domain_name]%0Amodule.app[0].aws_s3_bucket.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.app[0].aws_s3_bucket.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.s3.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=matchya-staging-company-assets]%0Amodule.vpc.data.aws_vpc.default: Read complete after 1s [id=vpc-02b04f5cc72d62471]%0Amodule.app[0].aws_s3_bucket_public_access_block.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_policy.www: Refreshing state... [id=www.app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_public_access_block.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_s3_bucket_website_configuration.main: Refreshing state... [id=app.staging.matchya.ai]%0Amodule.app[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:791901361445:certificate/e667d549-0230-491a-9fb3-ff620beb6361]%0Amodule.vpc.aws_ssm_parameter.vpc_id: Refreshing state... [id=/terraform/staging/vpc/id]%0Amodule.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b17f8e4d9515df62]%0Amodule.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-0ff1464a92bb07eb2]%0Amodule.vpc.aws_subnet.private_2[0]: Refreshing state... [id=subnet-0726a597984ed238a]%0Amodule.vpc.aws_security_group.ec2_public: Refreshing state... [id=sg-04e85193e7fb092b2]%0Amodule.vpc.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0fa7cfaddc1224493]%0Amodule.vpc.aws_security_group.lambda: Refreshing state... [id=sg-0b03235b8bdedcfda]%0Amodule.vpc.aws_subnet.public_1[0]: Refreshing state... [id=subnet-06cf952d5845d1e74]%0Amodule.vpc.aws_security_group.rds_postgres_secure[0]: Refreshing state... [id=sg-0a4c483087f4e3b71]%0Amodule.vpc.aws_subnet.public_2[0]: Refreshing state... [id=subnet-0ecb9c72602fa0542]%0Amodule.vpc.aws_subnet.private_1[0]: Refreshing state... [id=subnet-0c0048599d2031070]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a24b88055982d8e7]%0Amodule.vpc.aws_ssm_parameter.subnet_private_2[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_2]%0Amodule.vpc.aws_ssm_parameter.security_group_lambda: Refreshing state... [id=/terraform/staging/vpc/security_group_id/lambda]%0Amodule.vpc.aws_security_group.vpc_endpoint[0]: Refreshing state... [id=sg-07381fe46aca5ce9d]%0Amodule.vpc.aws_nat_gateway.nat[0]: Refreshing state... [id=nat-069a793c2ae6d655f]%0Amodule.vpc.aws_ssm_parameter.subnet_public_1: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_1]%0Amodule.app[0].aws_route53_record.cert_validation["app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__6540cac5e101cd74dc59720437629215.app.staging.matchya.ai._CNAME]%0Amodule.app[0].aws_route53_record.cert_validation["www.app.staging.matchya.ai"]: Refreshing state... [id=Z0419438LZ88EPNOCFMA__d3f0f366e8ab12f2c28f8e19045dc232.www.app.staging.matchya.ai._CNAME]%0Amodule.vpc.aws_ssm_parameter.subnet_public_2: Refreshing state... [id=/terraform/staging/vpc/subnet_id/public_2]%0Amodule.vpc.aws_route_table_association.public_2[0]: Refreshing state... [id=rtbassoc-0111cab42a3b8778b]%0Amodule.vpc.aws_route_table_association.public_1[0]: Refreshing state... [id=rtbassoc-0521ff9d78e1b21e2]%0Amodule.vpc.aws_ssm_parameter.subnet_private_1[0]: Refreshing state... [id=/terraform/staging/vpc/subnet_id/private_1]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-005bc3692e4a595fa]%0Amodule.ec2.aws_instance.bastion[0]: Refreshing state... [id=i-00512efc39438faca]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.vpc.aws_route_table_association.private_1[0]: Refreshing state... [id=rtbassoc-060c8560abd333606]%0Amodule.vpc.aws_route_table_association.private_2[0]: Refreshing state... [id=rtbassoc-088f0be8b3eacb2ca]%0Amodule.app[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2024-01-16 05:21:14.339 +0000 UTC]%0Amodule.app[0].aws_cloudfront_distribution.main: Refreshing state... [id=EUYAGYQTRL1WL]%0Amodule.app[0].aws_cloudfront_distribution.www: Refreshing state... [id=E2GZMTIUVXE6U8]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-KWJOE7ZAO5CCIOYKPIU72KYFF4]%0Amodule.app[0].aws_ssm_parameter.cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/app.staging.matchya.ai]%0Amodule.route53[0].aws_route53_record.app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_app.staging.matchya.ai_A]%0Amodule.app[0].aws_ssm_parameter.www_cloud_distribution_url: Refreshing state... [id=/terraform/staging/cloudfront/url/www.app.staging.matchya.ai]%0Amodule.app[0].aws_ssm_parameter.cloudfront_distribution_id: Refreshing state... [id=/terraform/staging/www.app.staging.matchya.ai/cloudfront_distribution_id]%0Amodule.route53[0].aws_route53_record.www_app: Refreshing state... [id=Z0419438LZ88EPNOCFMA_www.app.staging.matchya.ai_A]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.ec2.aws_eip.bastion[0]: Refreshing state... [id=eipalloc-0adce4ee56c7a5b5c]%0Amodule.ec2.aws_ssm_parameter.bastion_ip[0]: Refreshing state... [id=/terraform/staging/ec2/elastic_ip/bastion_host]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.rds.aws_db_instance.secure[0] will be updated in-place%0A  ~ resource "aws_db_instance" "secure" {%0A      ~ final_snapshot_identifier             = "staging-final-snapshot-2024-01-31-06-18-18" -> (known after apply)%0A        id                                    = "db-KWJOE7ZAO5CCIOYKPIU72KYFF4"%0A        tags                                  = {}%0A        # (52 unchanged attributes hidden)%0A    }%0A%0A  # module.s3.aws_s3_bucket.data_question_response_video will be created%0A  + resource "aws_s3_bucket" "data_question_response_video" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "matchya-staging-data-question-response-video"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket.test will be destroyed%0A  # (because aws_s3_bucket.test is not in configuration)%0A  - resource "aws_s3_bucket" "test" {%0A      - arn                         = "arn:aws:s3:::matchya-staging-data-question-response-video" -> null%0A      - bucket                      = "matchya-staging-data-question-response-video" -> null%0A      - bucket_domain_name          = "matchya-staging-data-question-response-video.s3.amazonaws.com" -> null%0A      - bucket_regional_domain_name = "matchya-staging-data-question-response-video.s3.us-east-1.amazonaws.com" -> null%0A      - force_destroy               = false -> null%0A      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null%0A      - id                          = "matchya-staging-data-question-response-video" -> null%0A      - object_lock_enabled         = false -> null%0A      - policy                      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - region                      = "us-east-1" -> null%0A      - request_payer               = "BucketOwner" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A%0A      - cors_rule {%0A          - allowed_headers = [%0A              - "*",%0A            ] -> null%0A          - allowed_methods = [%0A              - "POST",%0A              - "GET",%0A              - "PUT",%0A            ] -> null%0A          - allowed_origins = [%0A              - "app.staging.matchya.ai",%0A            ] -> null%0A          - expose_headers  = [%0A              - "ETag",%0A            ] -> null%0A          - max_age_seconds = 3000 -> null%0A        }%0A%0A      - grant {%0A          - id          = "aac9a733676e171bc328a7e44e7c5c7c37f5223e28542b26718df75ec0da1906" -> null%0A          - permissions = [%0A              - "FULL_CONTROL",%0A            ] -> null%0A          - type        = "CanonicalUser" -> null%0A        }%0A%0A      - server_side_encryption_configuration {%0A          - rule {%0A              - bucket_key_enabled = false -> null%0A%0A              - apply_server_side_encryption_by_default {%0A                  - sse_algorithm = "AES256" -> null%0A                }%0A            }%0A        }%0A%0A      - versioning {%0A          - enabled    = false -> null%0A          - mfa_delete = false -> null%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_cors_configuration.data_question_response_video will be created%0A  + resource "aws_s3_bucket_cors_configuration" "data_question_response_video" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + cors_rule {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_cors_configuration.test will be destroyed%0A  # (because aws_s3_bucket_cors_configuration.test is not in configuration)%0A  - resource "aws_s3_bucket_cors_configuration" "test" {%0A      - bucket = "matchya-staging-data-question-response-video" -> null%0A      - id     = "matchya-staging-data-question-response-video" -> null%0A%0A      - cors_rule {%0A          # At least one attribute in this block is (or was) sensitive,%0A          # so its contents will not be displayed.%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.data_question_response_video will be created%0A  + resource "aws_s3_bucket_policy" "data_question_response_video" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.test will be destroyed%0A  # (because aws_s3_bucket_policy.test is not in configuration)%0A  - resource "aws_s3_bucket_policy" "test" {%0A      - bucket = "matchya-staging-data-question-response-video" -> null%0A      - id     = "matchya-staging-data-question-response-video" -> null%0A      - policy = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "s3:*"%0A                      - Effect    = "Allow"%0A                      - Principal = "*"%0A                      - Resource  = "arn:aws:s3:::matchya-staging-data-question-response-video/*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.data_question_response_video will be created%0A  + resource "aws_s3_bucket_public_access_block" "data_question_response_video" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.test will be destroyed%0A  # (because aws_s3_bucket_public_access_block.test is not in configuration)%0A  - resource "aws_s3_bucket_public_access_block" "test" {%0A      - block_public_acls       = false -> null%0A      - block_public_policy     = false -> null%0A      - bucket                  = "matchya-staging-data-question-response-video" -> null%0A      - id                      = "matchya-staging-data-question-response-video" -> null%0A      - ignore_public_acls      = false -> null%0A      - restrict_public_buckets = false -> null%0A    }%0A%0APlan: 4 to add, 1 to change, 4 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: environment.tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "environment.tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```